In [2]:
elementos={
    'Numero atómico':[1,6,47,88],
    'Masa atómica':[1.008,12.011,107.87,226],
    'Familia':['No metal','No metal','Metal','Metal']
}

elementos

{'Numero atómico': [1, 6, 47, 88],
 'Masa atómica': [1.008, 12.011, 107.87, 226],
 'Familia': ['No metal', 'No metal', 'Metal', 'Metal']}

In [3]:
# Vamos a crear un DataFrama a partir de un diccionario
#Las claves del diccionario se van a convertir en las columnas del Dataframe
#los valores del diccionario en las listas, van a ser los valores de cada columna
import pandas as pd
tabla_periodica=pd.DataFrame(elementos)
tabla_periodica

   Numero atómico  Masa atómica   Familia
0               1         1.008  No metal
1               6        12.011  No metal
2              47       107.870     Metal
3              88       226.000     Metal

In [48]:
tabla_periodica.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Numero atómico  4 non-null      int64
 1   Masa atómica    4 non-null      float64
 2   Familia         4 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [49]:
tabla_periodica.describe()

       Numero atómico  Masa atómica
count        4.000000      4.000000
mean        35.500000     86.722250
std         40.616089    104.521485
min          1.000000      1.008000
25%          4.750000      9.260250
50%         26.500000     59.940500
75%         57.250000    137.402500
max         88.000000    226.000000

In [5]:
# Vamos a crear un DataFrama a partir de un diccionario
#Las claves del diccionario se van a convertir en las columnas del Dataframe
#los valores del diccionario en las listas, van a ser los valores de cada columna
import pandas as pd
#EL atributo index hace referencia a las filas del DataFrame o de una Serie
tabla_periodica=pd.DataFrame(elementos, index=['a','b','c','d'])
tabla_periodica

   Numero atómico  Masa atómica   Familia
a               1         1.008  No metal
b               6        12.011  No metal
c              47       107.870     Metal
d              88       226.000     Metal

In [6]:
#Crear diccionario unidades de datos
unidades_datos={
    'Ag':[2,4,3],
    'Au':[5,6,2],
    'Pt':[2,2,1],
    'Cu':[3,7,4]
}

#Index: Hace referencia a las etiquetas que le vamos a colocar a las filas
#Columns: Hace referencia a las etiquetas que le vamos a colocas a las columnas

#Tambien, si ya se tienen las etiquetas de las columnas en el diccionario que 
#son las palabras claves, se van a orden dependiendo el ordenn que coloquemos en el
#El atributo columns

In [7]:
columnas=['Ag','Au','Cu','Pt']
unidades=pd.DataFrame(unidades_datos,index=[2015,2016,20170],columns=columnas)
unidades

       Ag  Au  Cu  Pt
2015    2   5   3   2
2016    4   6   7   2
20170   3   2   4   1

In [8]:
#Vamos a crear un DataFrame a partir de varios diccionarios, donde cada diccionario
#Va a ser la filas del Dataframe
unidades_2015={'Ag':2,'Au':5,'Cu':3,'Pt':2}
unidades_2016={'Ag':4,'Au':6,'Cu':7,'Pt':2}
unidades_2017={'Ag':3,'Au':2,'Cu':4,'Pt':1}
unidadess=pd.DataFrame([unidades_2015,unidades_2016,unidades_2017],
                      index=[2015,2016,20170])
unidadess

       Ag  Au  Cu  Pt
2015    2   5   3   2
2016    4   6   7   2
20170   3   2   4   1

In [9]:
#Vamos a crear un DataFrame a partir de varios diccionarios, donde cada diccionario
#Va a ser la filas del Dataframe
unidades_2015={'Ag':2,'Au':5,'Cu':3,'Pt':2}
unidades_2016={'Ag':4,'Au':6,'Cu':7,'Pt':2}
unidades_2017={'Ag':3,'Au':2,'Cu':4,'Pt':1}
unidadess=pd.DataFrame([unidades_2015,unidades_2016,unidades_2017],
                      index=[2015,2016,20170],
                      columns=['Pt','Cu','Au','Ag'])
unidadess

       Pt  Cu  Au  Ag
2015    2   3   5   2
2016    2   7   6   4
20170   1   4   2   3

In [13]:
#Vamos a crear un DataFrame a partir de varios diccionarios, donde cada diccionario
#Va a ser la filas del Dataframe
unidades_2015={'Ag':2,'Au':5,'Cu':3,'Pt':2}
unidades_2016={'Ag':4,'Au':6,'Cu':7,'Pt':2}
unidades_2017={'Ag':3,'Cu':4,'Pb':1}
unidadess=pd.DataFrame([unidades_2015,unidades_2016,unidades_2017],
                      index=[2015,2016,2017])
unidadess

      Ag   Au  Cu   Pt   Pb
2015   2  5.0   3  2.0  NaN
2016   4  6.0   7  2.0  NaN
2017   3  NaN   4  NaN  1.0

# Metodo Head()

In [16]:
import pandas as pd
import numpy as np
entradas=pd.Series(np.arange(1,11),
                   index=['ene','feb','marz','abr','may','jun','jul','ago','sep','oct'])
entradas

ene      1
feb      2
marz     3
abr      4
may      5
jun      6
jul      7
ago      8
sep      9
oct     10
dtype: int64

In [19]:
import pandas as pd
import numpy as np
entradas=pd.Series([2,13,35,57,433,35,46,28,19,14],
                   index=['ene','feb','marz','abr','may','jun','jul','ago','sep','oct'])
entradas

ene       2
feb      13
marz     35
abr      57
may     433
jun      35
jul      46
ago      28
sep      19
oct      14
dtype: int64

In [20]:
import pandas as pd
import numpy as np
salidas=pd.Series([12,3,5,7,33,5,6,8,9,4],
                   index=['ene','feb','marz','abr','may','jun','jul','ago','sep','oct'])
salidas

ene     12
feb      3
marz     5
abr      7
may     33
jun      5
jul      6
ago      8
sep      9
oct      4
dtype: int64

In [17]:
entradas.head()

ene     1
feb     2
marz    3
abr     4
may     5
dtype: int64

In [18]:
entradas.head(3)

ene     1
feb     2
marz    3
dtype: int64

In [23]:
#Vamos a crear un dataframe a partir de los series, la serie de entradas, y la serie
#de salidas
almacen=pd.DataFrame({'Entradas':entradas,'Salidas':salidas})
almacen

      Entradas  Salidas
ene          2       12
feb         13        3
marz        35        5
abr         57        7
may        433       33
jun         35        5
jul         46        6
ago         28        8
sep         19        9
oct         14        4

In [24]:
#Puedo crear una nueva serie o columna a partir de evaluar los datos de dos columnas 
#anteriores
almacen['neto']=almacen.Entradas-almacen.Salidas
almacen

      Entradas  Salidas  neto
ene          2       12   -10
feb         13        3    10
marz        35        5    30
abr         57        7    50
may        433       33   400
jun         35        5    30
jul         46        6    40
ago         28        8    20
sep         19        9    10
oct         14        4    10

In [25]:
almacen.head()

      Entradas  Salidas  neto
ene          2       12   -10
feb         13        3    10
marz        35        5    30
abr         57        7    50
may        433       33   400

In [26]:
almacen.head(2)

     Entradas  Salidas  neto
ene         2       12   -10
feb        13        3    10

In [27]:
# MEtodo tail retorna por defecto los ultimo 5 elementos de una Serie o un Dataframe
entradas.tail()

jun    35
jul    46
ago    28
sep    19
oct    14
dtype: int64

In [28]:
# MEtodo tail retorna por defecto los ultimo 5 elementos de una Serie o un Dataframe
almacen.tail()

     Entradas  Salidas  neto
jun        35        5    30
jul        46        6    40
ago        28        8    20
sep        19        9    10
oct        14        4    10

In [29]:
# MEtodo tail retorna por defecto los ultimo 5 elementos de una Serie o un Dataframe
almacen.tail(3)

     Entradas  Salidas  neto
ago        28        8    20
sep        19        9    10
oct        14        4    10

In [39]:
# MEtodo sample

#Retorna por defecto un unico valor, sin embargo podemos indicarle cuantos elementos queremos
#que nos retorne
entradas.sample()

feb    13
dtype: int64

In [40]:
# MEtodo sample

#Retorna por defecto un unico valor, sin embargo podemos indicarle cuantos elementos queremos
#que nos retorne
entradas.sample(3)

oct    14
feb    13
jun    35
dtype: int64

In [41]:
# MEtodo sample

#Retorna por defecto un unico valor, sin embargo podemos indicarle cuantos elementos queremos
#que nos retorne
almacen.sample(3)

     Entradas  Salidas  neto
sep        19        9    10
oct        14        4    10
abr        57        7    50

In [42]:
# Metodo Describe 

# Permite obtener datos estadisticos del analisis de una Serie o un Dataframe

almacen.describe()

         Entradas    Salidas        neto
count   10.000000  10.000000   10.000000
mean    68.200000   9.200000   59.000000
std    129.230887   8.766096  121.055543
min      2.000000   3.000000  -10.000000
25%     15.250000   5.000000   10.000000
50%     31.500000   6.500000   25.000000
75%     43.250000   8.750000   37.500000
max    433.000000  33.000000  400.000000

In [43]:
almacen.Entradas.describe

<bound method NDFrame.describe of ene       2
feb      13
marz     35
abr      57
may     433
jun      35
jul      46
ago      28
sep      19
oct      14
Name: Entradas, dtype: int64>

In [45]:
almacen['Entradas'].describe

<bound method NDFrame.describe of ene       2
feb      13
marz     35
abr      57
may     433
jun      35
jul      46
ago      28
sep      19
oct      14
Name: Entradas, dtype: int64>

In [44]:
almacen.describe(include='all')

         Entradas    Salidas        neto
count   10.000000  10.000000   10.000000
mean    68.200000   9.200000   59.000000
std    129.230887   8.766096  121.055543
min      2.000000   3.000000  -10.000000
25%     15.250000   5.000000   10.000000
50%     31.500000   6.500000   25.000000
75%     43.250000   8.750000   37.500000
max    433.000000  33.000000  400.000000

In [46]:
almacen.describe(percentiles=[0,0.5,2/3,1])

         Entradas    Salidas        neto
count   10.000000  10.000000   10.000000
mean    68.200000   9.200000   59.000000
std    129.230887   8.766096  121.055543
min      2.000000   3.000000  -10.000000
0%       2.000000   3.000000  -10.000000
50%     31.500000   6.500000   25.000000
66.7%   35.000000   8.000000   30.000000
100%   433.000000  33.000000  400.000000
max    433.000000  33.000000  400.000000

In [47]:
# MEtodo de info

almacen.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, ene to oct
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Entradas  10 non-null     int64
 1   Salidas   10 non-null     int64
 2   neto      10 non-null     int64
dtypes: int64(3)
memory usage: 620.0+ bytes

In [52]:
#MEtodo value_counts
#Me  visualiza cuantas ocurrencias de un numero en una serie o columna
import numpy as np
s=pd.Series([3,1,2,1,1,4,1,2,np.nan])
print(s)
s.value_counts()

0    3.0
1    1.0
2    2.0
3    1.0
4    1.0
5    4.0
6    1.0
7    2.0
8    NaN
dtype: float64

1.0    4
2.0    2
3.0    1
4.0    1
dtype: int64

In [53]:
#Atributo dropna en el metodo value_counts
s.value_counts(dropna=False)

1.0    4
2.0    2
3.0    1
4.0    1
NaN    1
dtype: int64

In [57]:
s_filtro=s.dropna()
s_filtro

0    3.0
1    1.0
2    2.0
3    1.0
4    1.0
5    4.0
6    1.0
7    2.0
dtype: float64

In [54]:
s.value_counts(bins=2)

(0.996, 2.5]    6
(2.5, 4.0]      2
dtype: int64

In [56]:
s.value_counts(bins=[1,5])

(0.999, 5.0]    8
dtype: int64

In [63]:
# Seleccion de series
import pandas as pd
s=pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [65]:
#Cuando no se utilizan etiquetas en una serie no podemos acceder a sus elementos por 
#medio de indices negativos
s[-1]

KeyError: -1

In [60]:
#Como podemos acceder a los elementos que se encuentran en una serie o columna
print(s[0])
print(s[3])

10
40

In [66]:
# Seleccion de series mediante etiquetas
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [68]:
#Me obtiene el ultimo elemento de una Serie, similar a una lista, solo funciona cuando
#las filas o los indices de las filas tienen una etiqueta
s[-1]

40

In [69]:
print(s['b'])
print(s[2])

20
30

In [70]:
#Usar un rango de valores
# Seleccion de series mediante etiquetas
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [72]:
#Rango de valores, permite obtener los valores de la fila 1 hasta la fila3
#El primer indice lo incluye, mientras que el segundo indice no es incluido
s[1:3]

b    20
c    30
dtype: int64

In [73]:
s[1:]

b    20
c    30
d    40
dtype: int64

In [74]:
s[:3]

a    10
b    20
c    30
dtype: int64

In [75]:
#Cuando se usan etiquetas, el segundo indice si se incluye
s['a':'c']

a    10
b    20
c    30
dtype: int64

In [76]:
s[:'c']

a    10
b    20
c    30
dtype: int64

In [77]:
s['c':]

c    30
d    40
dtype: int64

In [78]:
# Vamos a crear un DataFrama a partir de un diccionario
#Las claves del diccionario se van a convertir en las columnas del Dataframe
#los valores del diccionario en las listas, van a ser los valores de cada columna
import pandas as pd
tabla_periodica=pd.DataFrame(elementos)
tabla_periodica

   Numero atómico  Masa atómica   Familia
0               1         1.008  No metal
1               6        12.011  No metal
2              47       107.870     Metal
3              88       226.000     Metal

In [79]:
tabla_periodica[1:3]

   Numero atómico  Masa atómica   Familia
1               6        12.011  No metal
2              47       107.870     Metal

# Metodo iloc

In [80]:
#Usar un rango de valores
# Seleccion de series mediante etiquetas
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [82]:
#Puedo filtrar a partir del indice de una fila en una serie
s.iloc[1]

20

In [83]:
s.iloc[-1]

40

In [92]:
s.iloc[[2,0,1]]

c    30
a    10
b    20
dtype: int64

In [85]:
s.iloc[[-2,0]]

c    30
a    10
dtype: int64

In [87]:
s.iloc[1:3]

b    20
c    30
dtype: int64

In [88]:
s.iloc[:3]

a    10
b    20
c    30
dtype: int64

In [89]:
s.iloc[1:-1]

b    20
c    30
dtype: int64

In [90]:
#Metodo loc
#Este metodo funciona con las etiquetas
s.loc['a':'c']

a    10
b    20
c    30
dtype: int64

In [97]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.arange(12).reshape([4,3]),
                                  index=['a','b','c','d'],
                                  columns=['A','B','C'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [100]:
df.loc['b':'c','A':'B']

   A  B
b  3  4
c  6  7

In [107]:
#Modificados unos valores de un dataframe a partir del filtrado con la funcion loc
#mediante las etiquetas
df.loc['b':'c','A':'B']=[[-1,-1],[-2,-2]]
df

   A   B   C
a  0   1   2
b -1  -1   5
c -2  -2   8
d  9  10  11

In [108]:
#Modificados unos valores de un dataframe a partir del filtrado con la funcion loc
#mediante las etiquetas
df.loc['b':'c','A':'B']=0
df

   A   B   C
a  0   1   2
b  0   0   5
c  0   0   8
d  9  10  11

In [113]:
#Modificados unos valores de un dataframe a partir del filtrado con la funcion loc
#mediante las etiquetas
df.iloc[0:2,1:3]=[[1,2],[3,4]]
df

   A   B   C
a  0   1   2
b  0   3   4
c  0   0   8
d  9  10  11

In [101]:
df.loc['d','C']

11

In [102]:
df.loc[df.B>5]

   A   B   C
c  6   7   8
d  9  10  11

In [105]:
#EL simbolo ampersan & me permite utilizar dos condicionales al filtrar datos en un 
#Dataframe
df.loc[(df.B>5) & (df.A==9)]

   A   B   C
d  9  10  11

In [104]:
#El metodo debe recibir una array de numpy
df.iloc[(df.B>5).values]

   A   B   C
c  6   7   8
d  9  10  11